class CountryLanguageMapper {
  static final Map<String, String> _languageMap = {
    "US": "Английский (US)",
    "GB": "Английский (BR)",
    "ES": "Испанский",
    "MX": "Испанский (MX)",
    "BR": "Португальский (BR)",
    "PT": "Португальский",
    "FR": "Французский",
    "DE": "Немецкий",
    "IT": "Итальянский",
    "RU": "Русский",
    "UZ": "Узбекский",
    "TR": "Турецкий",
    "CN": "Китайский",
    "JP": "Японский",
    "KR": "Корейский",
    "IN": "Хинди",
    "KZ": "Казахский",
    "UA": "Украинский",
    "PL": "Польский",
    "NL": "Нидерландский",
    "GR": "Греческий",
    "CZ": "Чешский",
    "RO": "Румынский",
    "HU": "Венгерский",
    "SE": "Шведский",
    "NO": "Норвежский",
    "FI": "Финский",
    "DK": "Датский",
    "IL": "Иврит",
    "IR": "Персидский",
    "SA": "Арабский",
    "AE": "Арабский",
    "TH": "Тайский",
    "VN": "Вьетнамский",
    "ID": "Индонезийский",
    "MY": "Малайский",
    "PH": "Филиппинский",
    "RS": "Сербский",
    "SK": "Словацкий",
    "SI": "Словенский",
    "HR": "Хорватский",
  };

  static List<String> get supportedCountryCodes =>
      _languageMap.keys.toList();

  static String getLanguage(String code) =>
      _languageMap[code] ?? "";
}